zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100smax_48_tqfp.h
    /* P2.6 */
    P2_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P2_6_MSC0_SENSE                 =  4,       /* msc[0].sense:14 */
    P2_6_MSC0_SHIELD                =  5,       /* msc[0].shield:14 */
    P2_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P2_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P2_6_TCPWM_LINE1                =  8,       /* Digital Active - tcpwm.line[1]:1 */
    P2_6_SCB3_UART_CTS              =  9,       /* Digital Active - scb[3].uart_cts:1 */
    P2_6_PASS0_DSI_SAR_DATA5        = 10,       /* Digital Active - pass[0].dsi_sar_data[5]:0 */
    P2_6_AUDIOSS_TX_SDO             = 11,       /* Digital Active - audioss.tx_sdo:1 */
    P2_6_AUDIOSS0_TX_SDO            = 11,       /* Digital Active - audioss[0].tx_sdo:1:0 */
    P2_6_LCD_COM22                  = 12,       /* Digital Deep Sleep - lcd.com[22] */
    P2_6_LCD_SEG22                  = 13,       /* Digital Deep Sleep - lcd.seg[22] */
    P2_6_SCB1_SPI_SELECT3           = 15,       /* Digital Deep Sleep - scb[1].spi_select3:1 */

    /* P2.7 */
    P2_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P2_7_MSC0_SENSE                 =  4,       /* msc[0].sense:15 */
    P2_7_MSC0_SHIELD                =  5,       /* msc[0].shield:15 */
    P2_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P2_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P2_7_TCPWM_LINE_COMPL1          =  8,       /* Digital Active - tcpwm.line_compl[1]:1 */
    P2_7_SCB3_UART_RTS              =  9,       /* Digital Active - scb[3].uart_rts:1 */
    P2_7_PASS0_DSI_SAR_DATA6        = 10,       /* Digital Active - pass[0].dsi_sar_data[6]:0 */
    P2_7_AUDIOSS_CLK_I2S_IF         = 11,       /* Digital Active - audioss.clk_i2s_if:1 */
    P2_7_AUDIOSS0_CLK_I2S_IF        = 11,       /* Digital Active - audioss[0].clk_i2s_if:1:0 */
    P2_7_LCD_COM23                  = 12,       /* Digital Deep Sleep - lcd.com[23] */
    P2_7_LCD_SEG23                  = 13,       /* Digital Deep Sleep - lcd.seg[23] */
    P2_7_LPCOMP_COMP0               = 14,       /* Digital Deep Sleep - lpcomp.comp[0]:0 */
    P2_7_SCB2_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[2].spi_mosi:1 */

    /* P3.0 */
    P3_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P3_0_MSC0_SENSE                 =  4,       /* msc[0].sense:30 */
    P3_0_MSC0_SHIELD                =  5,       /* msc[0].shield:30 */
    P3_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P3_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P3_0_TCPWM_LINE0                =  8,       /* Digital Active - tcpwm.line[0]:0 */
    P3_0_SCB1_UART_RX               =  9,       /* Digital Active - scb[1].uart_rx:1 */
    P3_0_PASS0_DSI_SAR_DATA7        = 10,       /* Digital Active - pass[0].dsi_sar_data[7]:0 */
    P3_0_AUDIOSS_CLK_I2S_IF         = 11,       /* Digital Active - audioss.clk_i2s_if:0 */
    P3_0_AUDIOSS0_CLK_I2S_IF        = 11,       /* Digital Active - audioss[0].clk_i2s_if:0:0 */
    P3_0_LCD_COM24                  = 12,       /* Digital Deep Sleep - lcd.com[24] */
    P3_0_LCD_SEG24                  = 13,       /* Digital Deep Sleep - lcd.seg[24] */
    P3_0_SCB1_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[1].i2c_scl:2 */
    P3_0_SCB1_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[1].spi_mosi:0 */

    /* P3.1 */
    P3_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P3_1_MSC0_SENSE                 =  4,       /* msc[0].sense:31 */
    P3_1_MSC0_SHIELD                =  5,       /* msc[0].shield:31 */
    P3_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P3_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P3_1_TCPWM_LINE_COMPL0          =  8,       /* Digital Active - tcpwm.line_compl[0]:0 */
    P3_1_SCB1_UART_TX               =  9,       /* Digital Active - scb[1].uart_tx:1 */
    P3_1_PASS0_DSI_SAR_DATA8        = 10,       /* Digital Active - pass[0].dsi_sar_data[8]:0 */
    P3_1_LCD_COM25                  = 12,       /* Digital Deep Sleep - lcd.com[25] */
    P3_1_LCD_SEG25                  = 13,       /* Digital Deep Sleep - lcd.seg[25] */
    P3_1_SCB1_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[1].i2c_sda:2 */
    P3_1_SCB1_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[1].spi_miso:0 */

    /* P3.2 */
    P3_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P3_2_MSC0_SENSE                 =  4,       /* msc[0].sense:32 */
    P3_2_MSC0_SHIELD                =  5,       /* msc[0].shield:32 */
    P3_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P3_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P3_2_TCPWM_LINE1                =  8,       /* Digital Active - tcpwm.line[1]:0 */
    P3_2_SCB1_UART_CTS              =  9,       /* Digital Active - scb[1].uart_cts:1 */
    P3_2_LCD_COM26                  = 12,       /* Digital Deep Sleep - lcd.com[26] */
    P3_2_LCD_SEG26                  = 13,       /* Digital Deep Sleep - lcd.seg[26] */
    P3_2_CPUSS_SWD_DATA             = 14,       /* Digital Deep Sleep - cpuss.swd_data:0 */
    P3_2_SCB1_SPI_CLK               = 15,       /* Digital Deep Sleep - scb[1].spi_clk:0 */

    /* P3.3 */
    P3_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P3_3_MSC0_SENSE                 =  4,       /* msc[0].sense:33 */
    P3_3_MSC0_SHIELD                =  5,       /* msc[0].shield:33 */
    P3_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P3_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P3_3_TCPWM_LINE_COMPL1          =  8,       /* Digital Active - tcpwm.line_compl[1]:0 */
    P3_3_SCB1_UART_RTS              =  9,       /* Digital Active - scb[1].uart_rts:1 */
    P3_3_LCD_COM27                  = 12,       /* Digital Deep Sleep - lcd.com[27] */
    P3_3_LCD_SEG27                  = 13,       /* Digital Deep Sleep - lcd.seg[27] */
    P3_3_CPUSS_SWD_CLK              = 14,       /* Digital Deep Sleep - cpuss.swd_clk:0 */
    P3_3_SCB1_SPI_SELECT0           = 15,       /* Digital Deep Sleep - scb[1].spi_select0:0 */

    /* P3.4 */
    P3_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P3_4_MSC0_SENSE                 =  4,       /* msc[0].sense:34 */
    P3_4_MSC0_SHIELD                =  5,       /* msc[0].shield:34 */
    P3_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P3_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P3_4_TCPWM_LINE2                =  8,       /* Digital Active - tcpwm.line[2]:0 */
    P3_4_TCPWM_TR_IN6               = 11,       /* Digital Active - tcpwm.tr_in[6] */
    P3_4_LCD_COM28                  = 12,       /* Digital Deep Sleep - lcd.com[28] */
    P3_4_LCD_SEG28                  = 13,       /* Digital Deep Sleep - lcd.seg[28] */
    P3_4_SCB1_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[1].spi_select1:0 */

    /* P3.5 */
    P3_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P3_5_MSC0_SENSE                 =  4,       /* msc[0].sense:35 */
    P3_5_MSC0_SHIELD                =  5,       /* msc[0].shield:35 */
    P3_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P3_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P3_5_TCPWM_LINE_COMPL2          =  8,       /* Digital Active - tcpwm.line_compl[2]:0 */
    P3_5_AUDIOSS_TX_SCK             = 11,       /* Digital Active - audioss.tx_sck:0 */
    P3_5_AUDIOSS0_TX_SCK            = 11,       /* Digital Active - audioss[0].tx_sck:0:0 */
    P3_5_LCD_COM29                  = 12,       /* Digital Deep Sleep - lcd.com[29] */
    P3_5_LCD_SEG29                  = 13,       /* Digital Deep Sleep - lcd.seg[29] */
    P3_5_SCB1_SPI_SELECT2           = 15,       /* Digital Deep Sleep - scb[1].spi_select2:0 */

    /* P3.6 */
    P3_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P3_6_MSC0_SENSE                 =  4,       /* msc[0].sense:36 */
    P3_6_MSC0_SHIELD                =  5,       /* msc[0].shield:36 */
    P3_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P3_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P3_6_TCPWM_LINE3                =  8,       /* Digital Active - tcpwm.line[3]:0 */
    P3_6_PASS0_DSI_CTB_CMP0         = 10,       /* Digital Active - pass[0].dsi_ctb_cmp0 */
    P3_6_AUDIOSS_TX_SDO             = 11,       /* Digital Active - audioss.tx_sdo:0 */
    P3_6_AUDIOSS0_TX_SDO            = 11,       /* Digital Active - audioss[0].tx_sdo:0:0 */
    P3_6_LCD_COM30                  = 12,       /* Digital Deep Sleep - lcd.com[30] */
    P3_6_LCD_SEG30                  = 13,       /* Digital Deep Sleep - lcd.seg[30] */
    P3_6_SCB4_SPI_SELECT3           = 14,       /* Digital Deep Sleep - scb[4].spi_select3 */
    P3_6_SCB1_SPI_SELECT3           = 15,       /* Digital Deep Sleep - scb[1].spi_select3:0 */

